src/InformationRegisters/кфкИсходящиеСообщения/кфкИсходящиеСообщения.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>кфкИсходящиеСообщения</name>
  <resources>
    <name>Статус</name>
    <type>
      <types>EnumRef.кфкСтатусыСообщений</types>
    </type>
  </resources>
  <resources>
    <name>ИсходныеДанные</name>
    <type>
      <types>ValueStorage</types>
    </type>
  </resources>
  <resources>
    <name>ЭтоУдаление</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>КлючСообщения</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>64</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>Заголовки</name>
    <type>
      <types>ValueStorage</types>
    </type>
  </resources>
  <resources>
    <name>ТелоСообщения</name>
    <type>
      <types>ValueStorage</types>
    </type>
  </resources>
  <attributes>
    <name>Продюсер</name>
    <type>
      <types>CatalogRef.кфкПродюсеры</types>
    </type>
  </attributes>
  <attributes>
    <name>ТипОбъект</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>120</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ТипИсходныхДанных</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>120</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>КлючОбъекта</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>64</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>СобытиеРегистрации</name>
    <type>
      <types>EnumRef.кфкСобытияРегистрации</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаРегистрации</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаОбработки</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаВыгрузки</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>ДлОбработкиМС</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ТекстЖурнала</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>КоличествоОбработок</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>3</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>КоличествоВыгрузок</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>3</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>МеткаИзменения</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>30</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <dimensions>
    <name>КлючЗаписи</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>64</length>
      </stringQualifiers>
    </type>
  </dimensions>
  <dimensions>
    <name>МеткаРегистрации</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>30</precision>
      </numberQualifiers>
    </type>
  </dimensions>
</mdclass:InformationRegister>

src/Enums/кфкСобытияРегистрации/кфкСобытияРегистрации.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>кфкСобытияРегистрации</name>
  <enumValues>
    <name>ПриЗаписи</name>
  </enumValues>
  <enumValues>
    <name>Программно</name>
  </enumValues>
  <enumValues>
    <name>Принудительно</name>
  </enumValues>
</mdclass:Enum>

src/Enums/кфкСтатусыСообщений/кфкСтатусыСообщений.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>кфкСтатусыСообщений</name>
  <enumValues>
    <name>Новое</name>
  </enumValues>
  <enumValues>
    <name>Обработано</name>
  </enumValues>
  <enumValues>
    <name>ОбработкаОтменена</name>
  </enumValues>
  <enumValues>
    <name>ОшибкаОбработки</name>
  </enumValues>
  <enumValues>
    <name>Выгружено</name>
  </enumValues>
  <enumValues>
    <name>ОшибкаВыгрузки</name>
  </enumValues>
  <enumValues>
    <name>ВыгрузкаОтменена</name>
  </enumValues>
</mdclass:Enum>

src/Catalogs/кфкПродюсеры/кфкПродюсеры.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>кфкПродюсеры</name>
  <hierarchical>true</hierarchical>
  <attributes>
    <name>Брокер</name>
    <type>
      <types>CatalogRef.кфкБрокеры</types>
    </type>
  </attributes>
  <attributes>
    <name>РежимАсинх</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>БлокироватьРегистрацию</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>БлокироватьСериализацию</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>БлокироватьПубликацию</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ИдемпотентнаяОтправка</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ПодпотокиОбработки</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>2</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ПодпотокиТранспорта</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>2</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ОтключитьДедупликацию</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <tabularSections>
    <name>ОбъектыМетаданных</name>
    <attributes>
      <name>ТипОбъект</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>430</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ИмяТопика</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>128</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ТипСериализации</name>
      <type>
        <types>EnumRef.кфкТипыОбработчиков</types>
      </type>
    </attributes>
    <attributes>
      <name>ИмяМетодаСериализации</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>150</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ИмяМодуляСериализации</name>
      <comment>Менеджер обмена (КД 3.1)</comment>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>120</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ИмяПОДСериализации</name>
      <comment>Имя ПОД (КД 3.1)</comment>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>120</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ФорматСериализации</name>
      <comment>Формат (КД 3.1)</comment>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>120</length>
        </stringQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ПараметрыПродюсера</name>
    <attributes>
      <name>Ключ</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>128</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Значение</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>128</length>
        </stringQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

src/CommonModules/кфкОбработкаСобытийСлужебный/Module.bsl
///////////////////////////////////////////////////////////////////////////////////////////////////////
// Copyright (c) 2026, ShadobaAI
// Этот файл является частью программного обеспечения, распространяемого на условиях
// Mozilla Public License, версия 2.0 (MPL-2.0).
// Текст лицензии доступен по ссылке:
// https://mozilla.org/MPL/2.0/
///////////////////////////////////////////////////////////////////////////////////////////////////////

// @strict-types
#Область СлужебныйПрограммныйИнтерфейс

// Параметры регистрации.
// 
// Параметры:
//  Продюсеры - Неопределено, СправочникСсылка.кфкПродюсеры, Массив Из СправочникСсылка.кфкПродюсеры - Ссылка на продюсер
//  ПакетныйРежимЗаписи - Булево - Если Истина, то инициализируется "ОчередьИсходящих". По завершении необходимо вызвать ЗавершитьРегистрацию(Параметры)
// 
// Возвращаемое значение:
//  Структура - Параметры регистрации:
// * Продюсеры - Неопределено, Массив Из СправочникСсылка.кфкПродюсеры - Ссылка на продюсер 
// * ОчередьИсходящих - Неопределено, РегистрСведенийНаборЗаписей.кфкИсходящиеСообщения - Очередь исходящих, см. ЗавершитьРегистрацию
Функция ПараметрыРегистрации(Продюсеры = Неопределено, ПакетныйРежимЗаписи = Ложь) Экспорт

	Результат = Новый Структура;

	Если ТипЗнч(Продюсеры) = Тип("Массив") Тогда
		ПродюсерыРегистрации = Продюсеры;

	ИначеЕсли ЗначениеЗаполнено(Продюсеры) Тогда
		ПродюсерыРегистрации = ОбщегоНазначенияКлиентСервер.ЗначениеВМассиве(Продюсеры);

	Иначе
		ПродюсерыРегистрации = Неопределено;
	КонецЕсли;
	Результат.Вставить("Продюсеры", ПродюсерыРегистрации);

	ОчередьИсходящих = ?(ПакетныйРежимЗаписи,
		кфкОбщегоНазначенияСлужебный.СоздатьНаборЗаписей(РегистрыСведений.кфкИсходящиеСообщения),
		Неопределено);
	Результат.Вставить("ОчередьИсходящих", ОчередьИсходящих);

	//@skip-check constructor-function-return-section
	Возврат Результат;

КонецФункции

// Завершает пакетную регистрацию.
// 
// Параметры:
//  Параметры - Структура - Параметры регистрации, см. ПараметрыРегистрации:
//	 * Продюсеры - Неопределено, Массив Из СправочникСсылка.кфкПродюсеры - Ссылка на продюсер 
//	 * ОчередьИсходящих - Неопределено, РегистрСведенийНаборЗаписей.кфкИсходящиеСообщения - Очередь исходящих, см. ЗавершитьРегистрацию
//	ОчиститьОчередь - Булево - Очистить очередь исходящих
Процедура ЗавершитьРегистрацию(Параметры, ОчиститьОчередь = Ложь) Экспорт

	ОчередьИсходящих = Параметры.ОчередьИсходящих;
	Если Не ОчередьИсходящих = Неопределено И ОчередьИсходящих.Количество() > 0 Тогда

		// Если регистрация выполняется под обычным пользователем
		УстановитьПривилегированныйРежим(Истина); // BSLLS:SetPrivilegedMode-off

		ОчередьИсходящих.Записать(РежимЗамещения.Добавление);
		Если ОчиститьОчередь Тогда
			ОчередьИсходящих.Очистить();
		КонецЕсли;

	КонецЕсли;

КонецПроцедуры

// Возвращает максимально допустимый размер порции регистрации.
//
// Возвращаемое значение:
//   Число - максимальный размер порции регистрации
Функция МаксРазмерПорцииРегистрации() Экспорт
	Возврат 10000; // BSLLS:MagicNumber-off
КонецФункции

// Ключ конструктора сообщения.
// 
// Возвращаемое значение:
//  Строка - Ключ конструктора сообщения
Функция КлючКонструктораСообщения() Экспорт
	Возврат "кфк_a4bdb06b7b7df17d4f0fe377787ece84";
КонецФункции

// Помещает данные в очередь исходящих сообщений.
// 
// Параметры:
//  Источник - ЛюбаяСсылка - Ссылка на объект, подлежащий выгрузке;
//  		 - СправочникОбъект, ДокументОбъект, ПланВидовХарактеристикОбъект, ПланВидовРасчетаОбъект, ПланСчетовОбъект, БизнесПроцессОбъект, ЗадачаОбъект, ПланОбменаОбъект - Объект, подлежащий выгрузке;
//			 - РегистрСведенийНаборЗаписей - Набор записей регистра сведений, подлежащий выгрузке;
//			 - Структура, Соответствие Из Произвольный - произвольное сообщение
//			 - Структура - Описание сообщения, см. кфкИнтеграция.ПараметрыСообщения() 
//	СобытиеРегистрации - ПеречислениеСсылка.кфкСобытияРегистрации - Событие регистрации
//	ТипОбъект - Строка - Тип объект, подлежащий выгрузке.
//	ЭтоУдаление - Булево - Это удаление
//	ПараметрыРегистрации - Структура - Параметры регистрации, см. ПараметрыРегистрации:
//	 * Продюсеры - Неопределено, Массив Из СправочникСсылка.кфкПродюсеры - Ссылка на продюсер 
//	 * ОчередьИсходящих - Неопределено, РегистрСведенийНаборЗаписей.кфкИсходящиеСообщения - Очередь исходящих
//@skip-check method-too-many-params
Процедура ПоместитьВОчередьИсходящих(Источник, СобытиеРегистрации, ТипОбъект = "", ЭтоУдаление = Ложь,
		ПараметрыРегистрации = Неопределено) Экспорт

	// Если регистрация выполняется под обычным пользователем
	УстановитьПривилегированныйРежим(Истина); // BSLLS:SetPrivilegedMode-off

	ТипИсточника = ТипЗнч(Источник);
	ЭтоПроизвольноеСообщение = ТипИсточника = Тип("Структура") Или ТипИсточника = Тип("Соответствие");
	Если ЭтоПроизвольноеСообщение И ПустаяСтрока(ТипОбъект) Тогда
		ВызватьИсключение НСтр("ru = 'В произвольном режиме необходимо явно указать тип объекта!'");
	КонецЕсли;

	ТипОбъектXML = "";
	Если Не ЭтоПроизвольноеСообщение Тогда
		ТипЗнчXML = СериализаторXDTO.XMLТипЗнч(Источник);
		// проверка на тип конфигурации
		Если ТипЗнчXML = Неопределено
				Или ТипЗнчXML.URIПространстваИмен <> "http://v8.1c.ru/8.1/data/enterprise/current-config" Тогда
			Возврат;
		КонецЕсли;
		ТипОбъектXML = ТипЗнчXML.ИмяТипа;

		ОбъектМД = Источник.Метаданные();
		Если ПустаяСтрока(ТипОбъект) Тогда
			ТипОбъект = ОбъектМД.ПолноеИмя();
		КонецЕсли;
	КонецЕсли;

	Продюсеры = ПолучитьПродюсерыДляРегистрации(ПараметрыРегистрации, ТипОбъект);
	Если Продюсеры = Неопределено Тогда
		Возврат;
	КонецЕсли;

	Очередь = ОбщегоНазначенияКлиентСервер.СвойствоСтруктуры(ПараметрыРегистрации, "ОчередьИсходящих");
	ОчередьИсходящих = ?(Очередь = Неопределено,
		кфкОбщегоНазначенияСлужебный.СоздатьНаборЗаписей(РегистрыСведений.кфкИсходящиеСообщения),
		Очередь); // РегистрСведенийНаборЗаписей.кфкИсходящиеСообщения

	Если ЭтоПроизвольноеСообщение Тогда
		//@skip-check invocation-parameter-type-intersect
		ПоместитьВОчередьИсходящихПроизвольноеСообщение(
			Источник, СобытиеРегистрации, ТипОбъект, Продюсеры, ОчередьИсходящих);

	Иначе
		ПоместитьВОчередьИсходящихОбъектКонфигурации(
			Источник, ЭтоУдаление, СобытиеРегистрации, ТипОбъектXML, Продюсеры, ТипОбъект, ОчередьИсходящих);
	КонецЕсли;

	Если Очередь = Неопределено И ОчередьИсходящих.Количество() > 0 Тогда
		ОчередьИсходящих.Записать(РежимЗамещения.Добавление);
	КонецЕсли;

КонецПроцедуры

// Возвращает уникальный ключ объекта, который используется в исходящих сообщениях для идентификации объекта.
// 
// Параметры:
//	Данные - ЛюбаяСсылка, СправочникОбъект, ДокументОбъект, РегистрСведенийКлючЗаписи, РегистрНакопленияКлючЗаписи - Данные для регистрации.
//	HexСтрока - Булево - 
// 
// Возвращаемое значение:
//	Неопределено, Строка, ДвоичныеДанные - Ключ объекта
//
Функция КлючОбъекта(Данные, HexСтрока) Экспорт

	ТипЗнчXML = СериализаторXDTO.XMLТипЗнч(Данные);
	// проверка на тип конфигурации
	Если ТипЗнчXML = Неопределено
			Или ТипЗнчXML.URIПространстваИмен <> "http://v8.1c.ru/8.1/data/enterprise/current-config" Тогда
		Возврат Неопределено;
	КонецЕсли;
	ТипОбъектXML = ТипЗнчXML.ИмяТипа;
	ИмяБазовогоТипа = СтрРазделить(ТипОбъектXML, ".")[0];

	Если СтрЗаканчиваетсяНа(ИмяБазовогоТипа, "Object") Тогда
		Возврат XMLСтрока(Данные.Ссылка);
	КонецЕсли;

	Если СтрЗаканчиваетсяНа(ИмяБазовогоТипа, "Ref") Тогда
		Возврат XMLСтрока(Данные);
	КонецЕсли;

	Если ИмяБазовогоТипа = "InformationRegisterRecordKey" Тогда
		ОбъектМД = Данные.Метаданные();
		Если ОбъектМД.РежимЗаписи = Метаданные.СвойстваОбъектов.РежимЗаписиРегистра.Независимый Тогда
			ПоляОтбора = СтрСоединить(кфкОбщегоНазначенияСлужебный.КлючиРегистра(ОбъектМД), ",");
			Отбор = Новый Структура(ПоляОтбора);
			ЗаполнитьЗначенияСвойств(Отбор, Данные);
			Возврат ХешКлючаОбъекта(Отбор, HexСтрока);
		КонецЕсли;
		Возврат ХешКлючаОбъекта(Данные.Регистратор, HexСтрока);
	КонецЕсли;

	Если ИмяБазовогоТипа = "AccumulationRegisterRecordKey" Тогда
		Возврат ХешКлючаОбъекта(Данные.Регистратор, HexСтрока);
	КонецЕсли;

	Если ИмяБазовогоТипа = "AccountingRegisterRecordKey" Тогда
		Возврат ХешКлючаОбъекта(Данные.Регистратор, HexСтрока);
	КонецЕсли;

	Если ИмяБазовогоТипа = "CalculationRegisterRecordKey" Тогда
		Возврат ХешКлючаОбъекта(Данные.Регистратор, HexСтрока);
	КонецЕсли;

	Возврат Неопределено;

КонецФункции

// Возвращает ключи записей исходящих сообщений для данных.
// 
// Параметры:
//  Данные - ЛюбаяСсылка, СправочникОбъект, ДокументОбъект, РегистрСведенийКлючЗаписи, РегистрНакопленияКлючЗаписи - Данные для регистрации.
// 
// Возвращаемое значение:
//  Неопределено, Массив Из Строка - Ключи записей исходящих сообщений
Функция КлючЗаписиИсходящихСообщений(Данные) Экспорт
	
	КлючОбъекта = КлючОбъекта(Данные, Ложь);
	Если КлючОбъекта = Неопределено Тогда
		Возврат Неопределено;
	КонецЕсли;
	
	ТипОбъект = Метаданные.НайтиПоТипу(ТипЗнч(Данные)).ПолноеИмя();
	
	Результат = Новый Массив; // Массив Из Строка
	Запрос = Новый Запрос("ВЫБРАТЬ Ссылка ИЗ Справочник.кфкПродюсеры.ОбъектыМетаданных ГДЕ ТипОбъект = &ТипОбъект");
	Запрос.УстановитьПараметр("ТипОбъект", ТипОбъект);
	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
		
		Хеш = Новый ХешированиеДанных(ХешФункция.SHA256);
		Хеш.Добавить(XMLСтрока(Выборка[0]));
		Хеш.Добавить(НРег(ТипОбъект));
		Хеш.Добавить(КлючОбъекта);
		КлючЗаписи = ПолучитьHexСтрокуИзДвоичныхДанных(Хеш.ХешСумма);
		
		Результат.Добавить(КлючЗаписи);
		
	КонецЦикла;
	
	Возврат ?(Результат.Количество() = 0, Неопределено, Результат);
	
КонецФункции

#Область ОбработчикиПодписок

// Обработчик подписки события "ЗарегистрироватьИзмененияПриЗаписи"
// 
// Параметры:
//  Источник - СправочникОбъект, ПланВидовХарактеристикОбъект, БизнесПроцессОбъект, ПланОбменаОбъект, ДокументОбъект, ПланВидовРасчетаОбъект, ЗадачаОбъект, ПланСчетовОбъект - Источник
//  Отказ - Булево - Отказ
Процедура ЗарегистрироватьИзмененияПриЗаписи(Источник, Отказ) Экспорт
	
	Если ПропуститьРегистрацию(Источник, Отказ) Тогда
		Возврат;
	КонецЕсли;
	
	ОбработчикРегистрацииПриЗаписи(Источник, Ложь);
	
КонецПроцедуры

// Обработчик подписки события "ЗарегистрироватьИзмененияПередУдалением"
// 
// Параметры:
//  Источник - СправочникОбъект, ПланВидовХарактеристикОбъект, БизнесПроцессОбъект, ПланОбменаОбъект, ДокументОбъект, ПланВидовРасчетаОбъект, ЗадачаОбъект, ПланСчетовОбъект - Источник
//  Отказ - Булево - Отказ
Процедура ЗарегистрироватьИзмененияПередУдалением(Источник, Отказ) Экспорт
	
	Если ПропуститьРегистрацию(Источник, Отказ) Тогда
		Возврат;
	КонецЕсли;
	
	ОбработчикРегистрацииПриЗаписи(Источник, Истина);
	
КонецПроцедуры

// Обработчик подписки события "ЗарегистрироватьИзмененияНабораПриЗаписи"
// 
// Параметры:
//  Источник - РегистрСведенийНаборЗаписей, РегистрНакопленияНаборЗаписей, РегистрБухгалтерииНаборЗаписей - Источник
//  Отказ - Булево - Отказ
//  Замещение - Булево, РежимЗамещения - Режим записи набора
Процедура ЗарегистрироватьИзмененияНабораПриЗаписи(Источник, Отказ, Замещение) Экспорт

	Если ПропуститьРегистрацию(Источник, Отказ) Тогда
		Возврат;
	КонецЕсли;

	ЭтоУдаление = (Замещение = РежимЗамещения.Удаление Или Источник.Количество() = 0); // Булево
	ОбработчикРегистрацииПриЗаписи(Источник, ЭтоУдаление);

КонецПроцедуры

// Обработчик подписки события "ЗарегистрироватьИзмененияНабораРасчетаПриЗаписиПередЗаписью"
// 
// Параметры:
//	Источник - РегистрРасчетаНаборЗаписей - Источник
//	Отказ - Булево - Отказ
//	Замещение - Булево - Замещение
//	ТолькоЗапись - Булево - Только запись
//	ЗаписьФактическогоПериодаДействия - Булево - Запись фактического периода действия
//	ЗаписьПерерасчетов - Булево - Запись перерасчетов
Процедура ЗарегистрироватьИзмененияНабораРасчетаПриЗаписиПередЗаписью(Источник, Отказ, Замещение, ТолькоЗапись,
		ЗаписьФактическогоПериодаДействия, ЗаписьПерерасчетов) Экспорт
	
	Если ПропуститьРегистрацию(Источник, Отказ) Тогда
		Возврат;
	КонецЕсли;
	
	ЭтоУдаление = Источник.Количество() = 0; // Булево
	ОбработчикРегистрацииПриЗаписи(Источник, ЭтоУдаление);
	
КонецПроцедуры

#КонецОбласти

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

// Возвращает продюсеры из параметров регистрации или из настройки объекта интеграции.
//
// Параметры:
//	ПараметрыРегистрации - Неопределено, Структура - Параметры регистрации
//	ТипОбъект - Строка - Тип объекта
//
// Возвращаемое значение:
//	Произвольный - Продюсеры.
Функция ПолучитьПродюсерыДляРегистрации(ПараметрыРегистрации, ТипОбъект)

	Продюсеры = ОбщегоНазначенияКлиентСервер.СвойствоСтруктуры(ПараметрыРегистрации, "Продюсеры");
	Если Продюсеры = Неопределено Тогда
		//@skip-check dynamic-access-method-not-found
		Продюсеры = ПродюсерыОбъектаИнтеграции(ТипОбъект); // ФиксированныйМассив Из СправочникСсылка.кфкПродюсеры
	КонецЕсли;

	Возврат Продюсеры;

КонецФункции

// Продюсеры по ключу.
// 
// Параметры:
//	Ключ - Строка - Ключ
// 
// Возвращаемое значение:
//	Неопределено, ФиксированныйМассив Из СправочникСсылка.кфкПродюсеры - Продюсеры
Функция ПродюсерыОбъектаИнтеграции(Ключ)
	Возврат кфкИнтеграцияСлужебныйПовтИсп.ОбъектыИнтеграции().Получить(НРег(Ключ));
КонецФункции

// Возвращает хеш значения для ключа объекта.
//
// Параметры:
//	Данные - Произвольный - Данные для расчета хеша
//	HexСтрока - Булево - Если Истина, возвращается строковое представление хеша
//
// Возвращаемое значение:
//	Строка, ДвоичныеДанные - Хеш значения
Функция ХешКлючаОбъекта(Данные, HexСтрока)

	СтрокаXML = ОбщегоНазначения.ЗначениеВСтрокуXML(Данные);
	ХешОбъекта = Новый ХешированиеДанных(ХешФункция.SHA256);
	ХешОбъекта.Добавить(СтрокаXML);
	ХешСумма = ХешОбъекта.ХешСумма;

	Возврат ?(HexСтрока, ПолучитьHexСтрокуИзДвоичныхДанных(ХешСумма), ХешСумма);

КонецФункции

// Пропустить регистрацию.
// 
// Параметры:
//	Источник - СправочникОбъект, ДокументОбъект, РегистрСведенийНаборЗаписей, РегистрРасчетаНаборЗаписей - Источник
//	Отказ - Булево - Отказ
// 
// Возвращаемое значение:
//	Булево - Пропустить регистрацию
Функция ПропуститьРегистрацию(Источник, Отказ)
	
	ДополнительныеСвойства = Источник.ДополнительныеСвойства; // Структура
	
	Возврат Отказ
		Или ДополнительныеСвойства.Свойство("кфкПропуститьРегистрацию")
		Или ДополнительныеСвойства.Свойство("ОтключитьМеханизмРегистрацииОбъектов")
		Или ДополнительныеСвойства.Свойство("НеВыполнятьКонтрольУдаляемых")
		Или ДополнительныеСвойства.Свойство("СкрытиеКонфиденциальнойИнформации")
		Или ПродюсерыОбъектаИнтеграции(Источник.Метаданные().ПолноеИмя()) = Неопределено
		Или Не ПолучитьФункциональнуюОпцию("кфкИспользоватьИнтеграцию");
	
КонецФункции

// Обработчик событий "ЗарегистрироватьИзменения*"
// 	см. ЗарегистрироватьИзмененияПриЗаписи
// 	см. ЗарегистрироватьИзмененияНабораПриЗаписи
// 	см. ЗарегистрироватьИзмененияПередУдалением
// 
// Параметры:
//  Источник - СправочникОбъект, ПланВидовХарактеристикОбъект, ДокументОбъект, РегистрСведенийНаборЗаписей, РегистрРасчетаНаборЗаписей - Любой объект или набор записей
//  ЭтоУдаление - Булево - Это удаление
Процедура ОбработчикРегистрацииПриЗаписи(Источник, ЭтоУдаление)

	Попытка

		ПоместитьВОчередьИсходящих(Источник, Перечисления.кфкСобытияРегистрации.ПриЗаписи, "", ЭтоУдаление);

	Исключение

		Данные = Неопределено;
		ТекстОшибки = ОбработкаОшибок.ПодробноеПредставлениеОшибки(ИнформацияОбОшибке());

		ОбъектМетаданных = Источник.Метаданные();
		Если ОбщегоНазначения.ЭтоОбъектСсылочногоТипа(ОбъектМетаданных) Тогда
			Данные = Источник.Ссылка;
		КонецЕсли;

		Если ОбщегоНазначения.ЭтоРегистр(ОбъектМетаданных) Тогда
			ТекстОшибки = Строка(Источник.Отбор) + Символы.ПС + Символы.ПС + ТекстОшибки;
		КонецЕсли;

		ЗаписьЖурналаРегистрации(кфкОбщегоНазначенияСлужебный.ИмяПодсистемы() + НСтр("ru = '. Регистрация при записи'"),
			УровеньЖурналаРегистрации.Ошибка,
			ОбъектМетаданных,
			Данные,
			ТекстОшибки);

	КонецПопытки;

КонецПроцедуры

// Помещает в очередь исходящих объект конфигурации.
//
// Параметры:
//	Источник - СправочникОбъект, ДокументОбъект, РегистрСведенийНаборЗаписей - Объект регистрации
//	ЭтоУдаление - Булево - Это удаление
//	СобытиеРегистрации - ПеречислениеСсылка.кфкСобытияРегистрации - Событие регистрации
//	ТипОбъектXML - Строка - Тип объекта XML
//	Продюсеры - ФиксированныйМассив Из СправочникСсылка.кфкПродюсеры - Продюсеры
//	ТипОбъект - Строка - Тип объекта
//	Очередь - РегистрСведенийНаборЗаписей.кфкИсходящиеСообщения - Очередь исходящих сообщений
Процедура ПоместитьВОчередьИсходящихОбъектКонфигурации(Источник, ЭтоУдаление, СобытиеРегистрации, ТипОбъектXML,
		Продюсеры, ТипОбъект, Очередь)

	ИмяБазовогоТипа = СтрРазделить(ТипОбъектXML, ".")[0];
	Если СтрЗаканчиваетсяНа(ИмяБазовогоТипа, "Object") Или СтрЗаканчиваетсяНа(ИмяБазовогоТипа, "Ref") Тогда
		ПоместитьВОчередьИсходящихСсылочногоТипа(
			Источник, ЭтоУдаление, СобытиеРегистрации, ТипОбъектXML, Продюсеры, ТипОбъект, Очередь);
		Возврат;
	КонецЕсли;

	Если ИмяБазовогоТипа = "InformationRegisterRecordSet" Тогда
		ОбъектМД = Источник.Метаданные();
		Если ОбъектМД.РежимЗаписи = Метаданные.СвойстваОбъектов.РежимЗаписиРегистра.Независимый Тогда
			ПоместитьВОчередьИсходящихНезависимыйРегистр(
				Источник, ЭтоУдаление, СобытиеРегистрации, ТипОбъектXML, Продюсеры, ТипОбъект, Очередь);

		Иначе
			ПоместитьВОчередьИсходящихПодчиненныйРегистр(
				Источник, ЭтоУдаление, СобытиеРегистрации, ТипОбъектXML, Продюсеры, ТипОбъект, Очередь);
		КонецЕсли;
		Возврат;
	КонецЕсли;

	Если ИмяБазовогоТипа = "AccumulationRegisterRecordSet"
			Или ИмяБазовогоТипа = "AccountingRegisterRecordSet"
			Или ИмяБазовогоТипа = "CalculationRegisterRecordSet" Тогда
		ПоместитьВОчередьИсходящихПодчиненныйРегистр(
			Источник, ЭтоУдаление, СобытиеРегистрации, ТипОбъектXML, Продюсеры, ТипОбъект, Очередь);
	КонецЕсли;

КонецПроцедуры

// Помещает в очередь исходящих ссылочный тип
// 
// Параметры:
//	Источник - СправочникОбъект, ПланВидовХарактеристикОбъект, БизнесПроцессОбъект, ПланОбменаОбъект, ДокументОбъект, ПланВидовРасчетаОбъект, ЗадачаОбъект, ПланСчетовОбъект - Объект регистрации
//	ЭтоУдаление - Булево - Это удаление
//	СобытиеРегистрации - ПеречислениеСсылка.кфкСобытияРегистрации - Событие регистрации
//	ТипОбъектXML - Строка - Тип объекта XML
//	Продюсеры - ФиксированныйМассив Из СправочникСсылка.кфкПродюсеры - Продюсеры
//	ТипОбъект - Строка - Тип объекта
//	Очередь - РегистрСведенийНаборЗаписей.кфкИсходящиеСообщения - Очередь исходящие сообщений 
Процедура ПоместитьВОчередьИсходящихСсылочногоТипа(Источник, ЭтоУдаление, СобытиеРегистрации, ТипОбъектXML,
		Продюсеры, ТипОбъект, Очередь)
	
	ТекущаяДата = ТекущаяДатаСеанса();
	ТекущаяДатаМС = ТекущаяУниверсальнаяДатаВМиллисекундах();
	
	ЭтоОбъект = СтрНайти(ТипОбъектXML, "Object.") > 0;
	
	ИсходныеДанные = Новый Структура;
	ИсходныеДанные.Вставить("Данные", Источник);
	ИсходныеДанные.Вставить(
		"ДополнительныеСвойства",
		?(ЭтоОбъект, ПолучитьДополнительныеСвойства(Источник), Неопределено));
	Тело = кфкОбщегоНазначенияСлужебный.ЗначениеВХранилище(ИсходныеДанные); // ХранилищеЗначения
	
	КлючОбъекта = XMLСтрока(?(ЭтоОбъект, Источник.Ссылка, Источник));
	НТипОбъект = НРег(ТипОбъект);
	
	Для Каждого Продюсер Из Продюсеры Цикл // ФиксированныйМассив Из СправочникСсылка.кфкПродюсеры
		
		Хеш = Новый ХешированиеДанных(ХешФункция.SHA256);
		Хеш.Добавить(XMLСтрока(Продюсер));
		Хеш.Добавить(НТипОбъект);
		Хеш.Добавить(КлючОбъекта);
		КлючЗаписи = ПолучитьHexСтрокуИзДвоичныхДанных(Хеш.ХешСумма);
		
		НоваяСтрока = Очередь.Добавить();
		// измерения
		НоваяСтрока.КлючЗаписи = КлючЗаписи;
		НоваяСтрока.ДатаРегистрацииМС = ТекущаяДатаМС;
		// ресурсы
		НоваяСтрока.Статус = Перечисления.кфкСтатусыСообщений.Новое;
		НоваяСтрока.ИсходныеДанные = Тело;
		НоваяСтрока.ЭтоУдаление = ЭтоУдаление;
		// дополнительная информация об объекте
		НоваяСтрока.Продюсер = Продюсер;
		НоваяСтрока.ТипОбъект = ТипОбъект;
		НоваяСтрока.ТипИсходныхДанных = ТипОбъектXML;
		НоваяСтрока.КлючОбъекта = КлючОбъекта;
		// дополнительная информация о регистрации
		НоваяСтрока.СобытиеРегистрации = СобытиеРегистрации;
		НоваяСтрока.ДатаРегистрации = ТекущаяДата;
		НоваяСтрока.МеткаИзмененияМС = ТекущаяДатаМС;
		
	КонецЦикла;
	
КонецПроцедуры

// Помещает в очередь исходящих независимого регистра сведений
// 
// Параметры:
//	НаборЗаписей - РегистрСведенийНаборЗаписей - Объект регистрации
//	ЭтоУдаление - Булево - Это удаление
//	СобытиеРегистрации - ПеречислениеСсылка.кфкСобытияРегистрации - Событие регистрации
//	ТипОбъектXML - Строка - Тип объекта XML
//	Продюсеры - ФиксированныйМассив Из СправочникСсылка.кфкПродюсеры - Продюсеры
//	ТипОбъект - Строка - Тип объекта
//	Очередь - РегистрСведенийНаборЗаписей.кфкИсходящиеСообщения - Очередь исходящие сообщений 
Процедура ПоместитьВОчередьИсходящихНезависимыйРегистр(НаборЗаписей, ЭтоУдаление, СобытиеРегистрации,
		ТипОбъектXML, Продюсеры, ТипОбъект, Очередь)

	ТекущаяДата = ТекущаяДатаСеанса();
	ТекущаяДатаМС = ТекущаяУниверсальнаяДатаВМиллисекундах();

	ОбъектМД = НаборЗаписей.Метаданные();
	ПоляОтбора = СтрСоединить(кфкОбщегоНазначенияСлужебный.КлючиРегистра(ОбъектМД), ",");
	//@skip-check invocation-parameter-type-intersect
	ПоляЗаписи = СтрСоединить(ОбщегоНазначения.ВыгрузитьКолонку(НаборЗаписей.ВыгрузитьКолонки().Колонки, "Имя"), ",");

	Если НаборЗаписей.Количество() > 0 Тогда
		Таблица = НаборЗаписей; // РегистрСведенийНаборЗаписейИмяРегистраСведений, ТаблицаЗначений

	Иначе
		Таблица = НаборЗаписей.Выгрузить(); // РегистрСведенийНаборЗаписейИмяРегистраСведений, ТаблицаЗначений
		НоваяСтрока = Таблица.Добавить();
		Для Каждого Элемент Из НаборЗаписей.Отбор Цикл
			НоваяСтрока[Элемент.Имя] = Элемент.Значение;
		КонецЦикла;

	КонецЕсли;

	ДополнительныеСвойства = ПолучитьДополнительныеСвойства(НаборЗаписей);

	Для Каждого Запись Из Таблица Цикл // РегистрСведенийЗапись

		// КлючОбъекта - Хеш отбора
		Отбор = Новый Структура(ПоляОтбора);
		ЗаполнитьЗначенияСвойств(Отбор, Запись);
		СтрокаXML = ОбщегоНазначения.ЗначениеВСтрокуXML(Отбор);
		ХешОбъекта = Новый ХешированиеДанных(ХешФункция.SHA256);
		ХешОбъекта.Добавить(СтрокаXML);
		КлючОбъекта = ПолучитьHexСтрокуИзДвоичныхДанных(ХешОбъекта.ХешСумма);

		// Тело сообщения
		Данные = Новый Структура(ПоляЗаписи);
		ЗаполнитьЗначенияСвойств(Данные, Запись);
		Данные.Вставить("ДополнительныеСвойства", ДополнительныеСвойства);
		Тело = кфкОбщегоНазначенияСлужебный.ЗначениеВХранилище(Данные); // ХранилищеЗначения

		Для Каждого Продюсер Из Продюсеры Цикл

			ХешЗаписи = Новый ХешированиеДанных(ХешФункция.SHA256);
			ХешЗаписи.Добавить(XMLСтрока(Продюсер));
			ХешЗаписи.Добавить(НРег(ТипОбъект));
			ХешЗаписи.Добавить(ХешОбъекта.ХешСумма);
			КлючЗаписи = ПолучитьHexСтрокуИзДвоичныхДанных(ХешЗаписи.ХешСумма);

			НоваяСтрока = Очередь.Добавить();
			// измерения
			НоваяСтрока.КлючЗаписи = КлючЗаписи;
			НоваяСтрока.ДатаРегистрацииМС = ТекущаяДатаМС;
			// ресурсы
			НоваяСтрока.Статус = Перечисления.кфкСтатусыСообщений.Новое;
			НоваяСтрока.ИсходныеДанные = Тело;
			НоваяСтрока.ЭтоУдаление = ЭтоУдаление;
			// дополнительная информация об объекте
			НоваяСтрока.Продюсер = Продюсер;
			НоваяСтрока.ТипОбъект = ТипОбъект;
			НоваяСтрока.ТипИсходныхДанных = ТипОбъектXML;
			НоваяСтрока.КлючОбъекта = КлючОбъекта;
			// дополнительная информация о регистрации
			НоваяСтрока.СобытиеРегистрации = СобытиеРегистрации;
			НоваяСтрока.ДатаРегистрации = ТекущаяДата;
			НоваяСтрока.МеткаИзмененияМС = ТекущаяДатаМС;

		КонецЦикла;

	КонецЦикла;

КонецПроцедуры

// Помещает в очередь исходящих подчиненного регистра
// 
// Параметры:
//	НаборЗаписей - РегистрСведенийНаборЗаписей, РегистрНакопленияНаборЗаписей - Объект регистрации
//	ЭтоУдаление - Булево - Это удаление
//	СобытиеРегистрации - ПеречислениеСсылка.кфкСобытияРегистрации - Событие регистрации
//	ТипОбъектXML - Строка - Тип объекта XML
//	Продюсеры - ФиксированныйМассив Из СправочникСсылка.кфкПродюсеры - Продюсеры
//	ТипОбъект - Строка - Тип объекта
//	Очередь - РегистрСведенийНаборЗаписей.кфкИсходящиеСообщения - Очередь исходящие сообщений 
Процедура ПоместитьВОчередьИсходящихПодчиненныйРегистр(НаборЗаписей, ЭтоУдаление, СобытиеРегистрации,
		ТипОбъектXML, Продюсеры, ТипОбъект, Очередь)

	ТекущаяДата = ТекущаяДатаСеанса();
	ТекущаяДатаМС = ТекущаяУниверсальнаяДатаВМиллисекундах();

	Регистратор = НаборЗаписей.Отбор.Регистратор.Значение; // ДокументСсылка
	Если Не ЗначениеЗаполнено(Регистратор) Тогда
		Возврат;
	КонецЕсли;

	ДополнительныеСвойства = ПолучитьДополнительныеСвойства(НаборЗаписей);

	// КлючОбъекта - Хеш регистратора
	СтрокаXML = ОбщегоНазначения.ЗначениеВСтрокуXML(Регистратор);
	ХешОбъекта = Новый ХешированиеДанных(ХешФункция.SHA256);
	ХешОбъекта.Добавить(СтрокаXML);
	КлючОбъекта = ПолучитьHexСтрокуИзДвоичныхДанных(ХешОбъекта.ХешСумма);

	// Тело сообщения
	Данные = Новый Структура;
	Данные.Вставить("Регистратор", Регистратор);
	Данные.Вставить("ДополнительныеСвойства", ДополнительныеСвойства);
	Тело = кфкОбщегоНазначенияСлужебный.ЗначениеВХранилище(Данные); // ХранилищеЗначения

	Для Каждого Продюсер Из Продюсеры Цикл

		ХешЗаписи = Новый ХешированиеДанных(ХешФункция.SHA256);
		ХешЗаписи.Добавить(XMLСтрока(Продюсер));
		ХешЗаписи.Добавить(НРег(ТипОбъект));
		ХешЗаписи.Добавить(ХешОбъекта.ХешСумма);
		КлючЗаписи = ПолучитьHexСтрокуИзДвоичныхДанных(ХешЗаписи.ХешСумма);

		НоваяСтрока = Очередь.Добавить();
		// измерения
		НоваяСтрока.КлючЗаписи = КлючЗаписи;
		НоваяСтрока.ДатаРегистрацииМС = ТекущаяДатаМС;
		// ресурсы
		НоваяСтрока.Статус = Перечисления.кфкСтатусыСообщений.Новое;
		НоваяСтрока.ИсходныеДанные = Тело;
		НоваяСтрока.ЭтоУдаление = ЭтоУдаление;
		// дополнительная информация об объекте
		НоваяСтрока.Продюсер = Продюсер;
		НоваяСтрока.ТипОбъект = ТипОбъект;
		НоваяСтрока.ТипИсходныхДанных = ТипОбъектXML;
		НоваяСтрока.КлючОбъекта = КлючОбъекта;
		// дополнительная информация о регистрации
		НоваяСтрока.СобытиеРегистрации = СобытиеРегистрации;
		НоваяСтрока.ДатаРегистрации = ТекущаяДата;
		НоваяСтрока.МеткаИзмененияМС = ТекущаяДатаМС;

	КонецЦикла;

КонецПроцедуры

//	Помещает в очередь исходящих произвольные данные
// 
// Параметры:
//	Сообщение - Структура - Описание произвольного сообщения, см. кфкИнтеграция.ПараметрыСообщения():
//		* Данные - Строка, ДвоичныеДанные, Структура - Тело сообщения
//		* Ключ - Строка - Уникальный идентификатор сообщения
//		* Заголовки - Соответствие Из Строка - Заголовки сообщения
//	СобытиеРегистрации - ПеречислениеСсылка.кфкСобытияРегистрации - Событие регистрации
//	ТипОбъект - Строка - Тип объект
//	Продюсеры - ФиксированныйМассив Из СправочникСсылка.кфкПродюсеры - Продюсеры
//	Очередь - РегистрСведенийНаборЗаписей.кфкИсходящиеСообщения - Очередь исходящие сообщений
Процедура ПоместитьВОчередьИсходящихПроизвольноеСообщение(Сообщение, СобытиеРегистрации, ТипОбъект, Продюсеры, Очередь)
	
	ТекущаяДата = ТекущаяДатаСеанса();
	ТекущаяДатаМС = ТекущаяУниверсальнаяДатаВМиллисекундах();
	
	Если Сообщение.Свойство(КлючКонструктораСообщения()) Тогда
		Заголовки = ?(Сообщение.Заголовки.Количество() > 0,
			кфкОбщегоНазначенияСлужебный.ЗначениеВХранилище(Сообщение.Заголовки), Неопределено);
		ТекстОшибки = "";
		Данные = кфкИнтеграцияСлужебный.ТелоСообщения(Сообщение, ТекстОшибки); // Неопределено, Структура
		Если Данные = Неопределено Тогда
			ВызватьИсключение ТекстОшибки;
		КонецЕсли;
		Тело = кфкОбщегоНазначенияСлужебный.ЗначениеВХранилище(Данные); // ХранилищеЗначения
		
		Если ЗначениеЗаполнено(Сообщение.Ключ) Тогда
			КлючОбъекта = XMLСтрока(Сообщение.Ключ);
			
		Иначе
			СтрокаXML = ОбщегоНазначения.ЗначениеВСтрокуXML(Данные);
			ХешОбъекта = Новый ХешированиеДанных(ХешФункция.SHA256);
			ХешОбъекта.Добавить(СтрокаXML);
			КлючОбъекта = ПолучитьHexСтрокуИзДвоичныхДанных(ХешОбъекта.ХешСумма);
			
		КонецЕсли;
		
		Для Каждого Продюсер Из Продюсеры Цикл
			
			Хеш = Новый ХешированиеДанных(ХешФункция.SHA256);
			Хеш.Добавить(XMLСтрока(Продюсер));
			Хеш.Добавить(НРег(ТипОбъект));
			Хеш.Добавить(КлючОбъекта);
			КлючЗаписи = ПолучитьHexСтрокуИзДвоичныхДанных(Хеш.ХешСумма);
			
			НоваяСтрока = Очередь.Добавить();
			// измерения
			НоваяСтрока.КлючЗаписи = КлючЗаписи;
			НоваяСтрока.ДатаРегистрацииМС = ТекущаяДатаМС;
			// ресурсы
			НоваяСтрока.Статус = Перечисления.кфкСтатусыСообщений.Обработано;
			НоваяСтрока.Заголовки = Заголовки;
			НоваяСтрока.ТелоСообщения = Тело;
			// дополнительная информация об объекте
			НоваяСтрока.Продюсер = Продюсер;
			НоваяСтрока.ТипОбъект = ТипОбъект;
			НоваяСтрока.КлючОбъекта = КлючОбъекта;
			// дополнительная информация о регистрации
			НоваяСтрока.СобытиеРегистрации = СобытиеРегистрации;
			НоваяСтрока.ДатаРегистрации = ТекущаяДата;
			НоваяСтрока.МеткаИзмененияМС = ТекущаяДатаМС;
			
		КонецЦикла;
		
	Иначе
		СтрокаXML = ОбщегоНазначения.ЗначениеВСтрокуXML(Сообщение);
		ХешОбъекта = Новый ХешированиеДанных(ХешФункция.SHA256);
		ХешОбъекта.Добавить(СтрокаXML);
		КлючОбъекта = ПолучитьHexСтрокуИзДвоичныхДанных(ХешОбъекта.ХешСумма);
		
		Тело = кфкОбщегоНазначенияСлужебный.ЗначениеВХранилище(Сообщение); // ХранилищеЗначения
		ТипИсходныхДанных = Строка(ТипЗнч(Сообщение));
		
		Для Каждого Продюсер Из Продюсеры Цикл
			
			Хеш = Новый ХешированиеДанных(ХешФункция.SHA256);
			Хеш.Добавить(XMLСтрока(Продюсер));
			Хеш.Добавить(НРег(ТипОбъект));
			Хеш.Добавить(КлючОбъекта);
			КлючЗаписи = ПолучитьHexСтрокуИзДвоичныхДанных(Хеш.ХешСумма);
			
			НоваяСтрока = Очередь.Добавить();
			// измерения
			НоваяСтрока.КлючЗаписи = КлючЗаписи;
			НоваяСтрока.ДатаРегистрацииМС = ТекущаяДатаМС;
			// ресурсы
			НоваяСтрока.Статус = Перечисления.кфкСтатусыСообщений.Новое;
			НоваяСтрока.ИсходныеДанные = Тело;
			// дополнительная информация об объекте
			НоваяСтрока.Продюсер = Продюсер;
			НоваяСтрока.ТипОбъект = ТипОбъект;
			НоваяСтрока.ТипИсходныхДанных = ТипИсходныхДанных;
			НоваяСтрока.КлючОбъекта = КлючОбъекта;
			// дополнительная информация о регистрации
			НоваяСтрока.СобытиеРегистрации = СобытиеРегистрации;
			НоваяСтрока.ДатаРегистрации = ТекущаяДата;
			НоваяСтрока.МеткаИзмененияМС = ТекущаяДатаМС;
			
		КонецЦикла;
		
	КонецЕсли;
	
КонецПроцедуры

// Получить дополнительные свойства.
// 
// Параметры:
//  Источник - СправочникОбъект, ПланВидовХарактеристикОбъект, БизнесПроцессОбъект, ПланОбменаОбъект, ДокументОбъект, ПланВидовРасчетаОбъект, ЗадачаОбъект, ПланСчетовОбъект, РегистрСведенийНаборЗаписей - Источник
// 
// Возвращаемое значение:
//  Структура - Получить дополнительные свойства
Функция ПолучитьДополнительныеСвойства(Источник)

	МаксимальнаяДлинаДополнительногоСвойства = 1000;
	Результат = Новый Структура;

	Для Каждого Свойство Из Источник.ДополнительныеСвойства Цикл
		Значение = Неопределено;
		Если ПодготовитьЗначениеДополнительногоСвойства(
				Свойство.Значение, Значение, МаксимальнаяДлинаДополнительногоСвойства) Тогда
			Результат.Вставить(Свойство.Ключ, Значение);
		КонецЕсли;
	КонецЦикла;

	Возврат Результат;

КонецФункции

// Подготавливает значение дополнительного свойства для помещения в очередь.
//
// Параметры:
//	ИсходноеЗначение - Произвольный - Исходное значение свойства
//	Значение - Произвольный - Подготовленное значение
//	МаксимальнаяДлина - Число - Максимальная длина строкового представления
//
// Возвращаемое значение:
//	Булево - Истина, если свойство необходимо добавить
Функция ПодготовитьЗначениеДополнительногоСвойства(ИсходноеЗначение, Значение, МаксимальнаяДлина)

	Значение = НСтр("ru = '<Значение не поддерживается>'"); // Произвольный
	Если ИсходноеЗначение = Неопределено Или ИсходноеЗначение = Null Тогда
		Значение = Неопределено;
		Возврат Истина;
	КонецЕсли;

	ТипЗначения = ТипЗнч(ИсходноеЗначение);
	Если ТипЗначения = Тип("ХранилищеЗначения") Тогда
		Возврат Истина;
	КонецЕсли;

	Если ТипЗначения = Тип("ДвоичныеДанные") Тогда
		Возврат Истина;
	КонецЕсли;

	Если ТипЗначения = Тип("Строка") И СтрДлина(Строка(ИсходноеЗначение)) > МаксимальнаяДлина Тогда
		Возврат Истина;
	КонецЕсли;

	Если ЭтоКоллекцияДополнительногоСвойства(ТипЗначения) Тогда
		Попытка
			ЗначениеСтрокой = ОбщегоНазначения.ЗначениеВСтрокуXML(ИсходноеЗначение);
		Исключение
			Возврат Ложь;
		КонецПопытки;

		Если СтрДлина(ЗначениеСтрокой) < МаксимальнаяДлина Тогда
			Значение = ЗначениеСтрокой;
		КонецЕсли;
		Возврат Истина;
	КонецЕсли;

	ТипЗначенияXML = СериализаторXDTO.XMLТипЗнч(ИсходноеЗначение);
	Если ТипЗначенияXML = Неопределено Тогда
		Возврат Истина;
	КонецЕсли;

	Если ПустаяСтрока(ТипЗначенияXML.URIПространстваИмен) Тогда
		Возврат Истина;
	КонецЕсли;

	Если ПустаяСтрока(ТипЗначенияXML.ИмяТипа) Тогда
		Возврат Истина;
	КонецЕсли;

	Значение = ИсходноеЗначение;
	Возврат Истина;

КонецФункции

// Проверяет, требуется ли сериализация коллекции в строку XML.
//
// Параметры:
//	ТипЗначения - Тип - Тип значения
//
// Возвращаемое значение:
//	Булево - Истина, если значение является сериализуемой коллекцией
Функция ЭтоКоллекцияДополнительногоСвойства(ТипЗначения)

	Если ТипЗначения = Тип("Структура") Тогда
		Возврат Истина;
	КонецЕсли;
	Если ТипЗначения = Тип("ФиксированнаяСтруктура") Тогда
		Возврат Истина;
	КонецЕсли;
	Если ТипЗначения = Тип("Соответствие") Тогда
		Возврат Истина;
	КонецЕсли;
	Если ТипЗначения = Тип("ФиксированноеСоответствие") Тогда
		Возврат Истина;
	КонецЕсли;
	Если ТипЗначения = Тип("Массив") Тогда
		Возврат Истина;
	КонецЕсли;
	Если ТипЗначения = Тип("ФиксированныйМассив") Тогда
		Возврат Истина;
	КонецЕсли;
	Если ТипЗначения = Тип("ТаблицаЗначений") Тогда
		Возврат Истина;
	КонецЕсли;
	Если ТипЗначения = Тип("ДеревоЗначений") Тогда
		Возврат Истина;
	КонецЕсли;

	Возврат Ложь;

КонецФункции

#КонецОбласти
